Documents/бит_ФайлыГИСЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ФайлыГИСЖКХ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолговойПД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрисоединенныйФайл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СворачиватьТаблицу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонВыгрузкиГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныВыгрузкиГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонИзвещений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКоличествоДопУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СворачиватьТаблицуГорячегоВодоснабжения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СворачиватьТаблицуХолодногоВодоснабжения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКомнаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеДома</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нежилые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Жилые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗданий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокУлиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЛС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыОплат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>метка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_СКДТаблицГИСЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СКДТаблицГИСЖКХ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТаблицаШаблонаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТаблицыШаблоновГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ГрафыОтчетаПоГЦЖС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ГрафыОтчетаПоГЦЖС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Техобслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатаЗаНайм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВывозБытовыхОтходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отопление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Водопровод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Электроэнергия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Газ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГорячееВодоснобжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХолодноеВодоснабжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОчисткаСтоков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХВСДляГВС</Name>
					<Comment>Холодная вода для подогрева и обеспечения горячего водоснабжения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_ШаблоныВыгрузкиГИСЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ШаблоныВыгрузкиГИСЖКХ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияШаблона</Name>
					<Comment>Используется для выборочного обновления типовых макетов.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакета</Name>
					<Comment>Используется для выборочного обновления типовых макетов.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МакетСтраницы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНачальнойСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскийШаблон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыДомовГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыДомовГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаСодержания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПлатежныхДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоляШаблона</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяТаблицы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ТаблицыШаблоновГИСЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_ТаблицыШаблоновГИСЖКХ</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтраницаКолонка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерНачальнойСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/бит_ФайлыГИСЖКХ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

перем мТаблица1_2;
перем мТаблица3_6;


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДата();
	Редактор = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонВыгрузкиГИСЖКХ,"ШаблонПлатежныхДокументов") Тогда
		ПроверяемыеРеквизиты.Добавить("ШаблонИзвещений");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция выполняет сбора данных из базы по выбранному шаблону.
// Возвращаемое значение: Cоответствие, содержащие таблицы значений полученными запросами на основании СКД.
Функция СформироватьДанныеФайла() Экспорт
	МассивТипов = Новый Массив;
	Если ВсеДома ИЛИ Нежилые Тогда
		МассивТипов.Добавить(Справочники.бит_ТипыКвартиры.НежилоеПомещение);
	КонецЕсли;
	
	Если ВсеДома ИЛИ Жилые Тогда
		МассивТипов.Добавить(Справочники.бит_ТипыКвартиры.Коммунальная);
		МассивТипов.Добавить(Справочники.бит_ТипыКвартиры.ОбщежитиеКоридорнаяСистема);
		МассивТипов.Добавить(Справочники.бит_ТипыКвартиры.ОбщежитиеПоквартирноеИлиПокомнатноеЗаселение);
		МассивТипов.Добавить(Справочники.бит_ТипыКвартиры.БлокВДомеБлокированнойЗастройки);
		МассивТипов.Добавить(Справочники.бит_ТипыКвартиры.Отдельная);
		МассивТипов.Добавить(Справочники.бит_ТипыКвартиры.ПустаяСсылка());
	КонецЕсли;
	
	// Сворачивание задвоек в отборах.
	СписокЗданий.Свернуть("Здание");
	СписокУлиц.Свернуть("Улица");
	СписокЛС.Свернуть("ЛицевойСчет");
	
	// Настройки дерева шаблона.
	МассивТиповПоля = Новый Массив;
	МассивТиповПоля.Добавить(Тип("Строка"));
	МассивТиповПоля.Добавить(Тип("СправочникСсылка.бит_ТаблицыШаблоновГИСЖКХ"));
	
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Поле" 				   , Новый ОписаниеТипов(МассивТиповПоля,,,,Новый КвалификаторыСтроки(60)));
	Дерево.Колонки.Добавить("СтраницаКолонка"	   , ОбщегоНазначения.ОписаниеТипаЧисло(2,,ДопустимыйЗнак.Неотрицательный));
	Дерево.Колонки.Добавить("НомерНачальнойСтроки" , ОбщегоНазначения.ОписаниеТипаЧисло(2,,ДопустимыйЗнак.Неотрицательный));
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы,
	|	бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.Поле,
	|	бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.СтраницаКолонка,
	|	бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.НомерНачальнойСтроки
	|ПОМЕСТИТЬ ВТ_ПоляШаблона
	|ИЗ
	|	Справочник.бит_ШаблоныВыгрузкиГИСЖКХ.ПоляШаблона КАК бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона
	|ГДЕ
	|	бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.Ссылка = &Шаблон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоляШаблона.ИмяТаблицы КАК ИмяТаблицы,
	|	ВТ_ПоляШаблона.Поле,
	|	ВТ_ПоляШаблона.СтраницаКолонка,
	|	ВТ_ПоляШаблона.НомерНачальнойСтроки
	|ИЗ
	|	ВТ_ПоляШаблона КАК ВТ_ПоляШаблона
	|ИТОГИ ПО
	|	ИмяТаблицы";
	
	Запрос.УстановитьПараметр("Шаблон", ШаблонВыгрузкиГИСЖКХ);
	
	ВыборкаТаблиц = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НомерНачальнойСтрокиПоумолчанию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонВыгрузкиГИСЖКХ, "НомерНачальнойСтроки");
	
	МассивТаблиц = Новый Массив;
	
	// Обход по названию таблицы.
	Пока ВыборкаТаблиц.Следующий() Цикл
		КоллекцияСтрокРодитлей = Дерево.Строки;
		НСтрокаРодитель = КоллекцияСтрокРодитлей.Добавить();
		НСтрокаРодитель.Поле			= ВыборкаТаблиц.ИмяТаблицы;
		
		МассивТаблиц.Добавить(ВыборкаТаблиц.ИмяТаблицы);
		
		ВыборкаПолей = ВыборкаТаблиц.Выбрать();
		Пока ВыборкаПолей.Следующий() Цикл
			// Дозаполняем данные родителя.
			Если ВыборкаПолей.ИмяТаблицы = ВыборкаПолей.Поле Тогда
				НСтрокаРодитель.СтраницаКолонка		 = ВыборкаПолей.СтраницаКолонка;
				НСтрокаРодитель.НомерНачальнойСтроки = ?(ВыборкаПолей.НомерНачальнойСтроки = 0, НомерНачальнойСтрокиПоумолчанию, ВыборкаПолей.НомерНачальнойСтроки);
				Продолжить;
			КонецЕсли;
			
			КоллекцияСтрокРодитлейПолей = НСтрокаРодитель.Строки;
			НСтрокаПоля = КоллекцияСтрокРодитлейПолей.Добавить();
			НСтрокаПоля.Поле			= ВыборкаПолей.Поле;
			НСтрокаПоля.СтраницаКолонка = ВыборкаПолей.СтраницаКолонка;
		КонецЦикла; 
		
	КонецЦикла; 

	Если МассивТаблиц.Количество() = 0 Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	// Подготовка отборов.
	ЕстьОтборУлиц = СписокУлиц.Количество() > 0;
	ОтборУлицы = Новый СписокЗначений;
	ОтборУлицы.ЗагрузитьЗначения(СписокУлиц.ВыгрузитьКолонку("Улица"));
	
	ЕстьОтборЗданий =  СписокЗданий.Количество() > 0 ;
	ОтборЗдания = Новый СписокЗначений;
	ОтборЗдания.ЗагрузитьЗначения(СписокЗданий.ВыгрузитьКолонку("Здание"));
	
	ЕстьОтборЛС = СписокЛС.Количество() > 0;
	ОтборЛС = Новый СписокЗначений;
	ОтборЛС.ЗагрузитьЗначения(СписокЛС.ВыгрузитьКолонку("ЛицевойСчет"));
	
	ОтборУслуг = новый СписокЗначений;
	для каждого с из Услуги цикл
		Если с.Метка = истина тогда
			ОтборУслуг.Добавить(с.Услуга);
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборУслуг = ОтборУслуг.Количество() > 0;
	
	
	ОтборВидовОплат = новый СписокЗначений;
	для каждого с из ВидыОплат цикл
		Если с.Метка = истина тогда
			ОтборВидовОплат.Добавить(с.ВидОплаты);
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборВидовОплат = ОтборВидовОплат.Количество() > 0;

	
	ЕстьОтборОрганизация = ЗначениеЗаполнено(Организация);
	
	ОтборТипыДомов		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонВыгрузкиГИСЖКХ, "ТипыДомовГИСЖКХ");
	УслугаСодержания	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонВыгрузкиГИСЖКХ, "УслугаСодержания");
	ЕстьОтборТипыДомов	= ЗначениеЗаполнено(ОтборТипыДомов);
	
	Период = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонВыгрузкиГИСЖКХ,"Период");
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Период"				, Дата);
	
	// Для устаревший пользовательских макетов СКД.
	СтруктураПараметров.Вставить("ЕстьОтборУлиц"		, ЕстьОтборУлиц); 
	СтруктураПараметров.Вставить("ОтборУлицы"			, ОтборУлицы); 
	СтруктураПараметров.Вставить("ЕстьОтборЗданий"		, ЕстьОтборЗданий); 
	СтруктураПараметров.Вставить("ОтборЗдания"			, ОтборЗдания); 
	СтруктураПараметров.Вставить("ЕстьОтборЛС"			, ЕстьОтборЛС); 
	СтруктураПараметров.Вставить("ОтборЛС"				, ОтборЛС); 
	СтруктураПараметров.Вставить("ЕстьОтборОрганизация"	, ЕстьОтборОрганизация); 
	СтруктураПараметров.Вставить("Организация"			, Организация); 
	СтруктураПараметров.Вставить("ЕстьОтборТипыДомов"	, ЕстьОтборТипыДомов); 
	СтруктураПараметров.Вставить("ОтборТипыДомов"		, ОтборТипыДомов); 
	СтруктураПараметров.Вставить("УслугаСодержания"		, УслугаСодержания);
	СтруктураПараметров.Вставить("ТипКвартиры"			, МассивТипов);
	СтруктураПараметров.Вставить("ЕстьОтборУслуг"		, ЕстьОтборУслуг);
	СтруктураПараметров.Вставить("ОтборУслуг"			, ОтборУслуг);
	СтруктураПараметров.Вставить("ЕстьОтборВидовОплат"	, ЕстьОтборВидовОплат);
	СтруктураПараметров.Вставить("ОтборВидовОплат"		, ОтборВидовОплат);
	
	// Для новых отборов макетов СКД.
	//
	//Если ЕстьОтборУслуг Тогда
	//	СтруктураПараметров.Вставить("ОтборУслуг", ОтборУслуг); 
	//КонецЕсли;
	Если ЕстьОтборУслуг Тогда
		СтруктураПараметров.Вставить("СписокУслуг", ОтборУслуг); 
	КонецЕсли;     
	
	Если ЕстьОтборВидовОплат Тогда
		СтруктураПараметров.Вставить("СписокВидовоплат", ОтборВидовОплат); 
	КонецЕсли;     

	
	Если ЕстьОтборУлиц Тогда
		СтруктураПараметров.Вставить("СписокУлиц", ОтборУлицы); 
	КонецЕсли;
	
	Если ЕстьОтборЗданий Тогда
		СтруктураПараметров.Вставить("СписокЗданий", ОтборЗдания); 
	КонецЕсли;
	
	Если ЕстьОтборЛС Тогда
		СтруктураПараметров.Вставить("СписокЛС", ОтборЛС); 
	КонецЕсли;
	
	Если ЕстьОтборОрганизация Тогда
		СтруктураПараметров.Вставить("ОтборОрганизация", Организация); 
	КонецЕсли;
	
	Если ЕстьОтборТипыДомов Тогда
		СтруктураПараметров.Вставить("ТипДомаГИСЖКХ", ОтборТипыДомов); 
	КонецЕсли;
		
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонВыгрузкиГИСЖКХ, "ШаблонПлатежныхДокументов") = Истина Тогда
		СтруктураПараметров.Вставить("ШаблонИзвещений"	, ШаблонИзвещений);
		СтруктураПараметров.Вставить("ДолговойПД"		, ДолговойПД);
		СтруктураПараметров.Вставить("ЗаполнятьДопУслуги"	, ВыводитьКоличествоДопУслуг);
	КонецЕсли;
	
	СоответствиеДанныхМакета = ПолучитьДанныеПоСКД(МассивТаблиц, Период, СтруктураПараметров);	
	
	Если НЕ СоответствиеДанныхМакета.Количество() = 0 Тогда
		СоответствиеДанныхМакета.Вставить("Дерево", Дерево);
	КонецЕсли;
	
	Возврат СоответствиеДанныхМакета	
	
КонецФункции
	

Функция ПолучитьДанныеПоСКД(МассивТаблиц, Период, СтруктураПараметров)
	
	СоответствиеДанныхМакета = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	бит_СКДТаблицГИСЖКХСрезПоследних.ТаблицаШаблонаГИСЖКХ КАК ТаблицаШаблонаГИСЖКХ,
		|	бит_СКДТаблицГИСЖКХСрезПоследних.СхемаКомпоновкиДанных КАК СхемаКомпоновкиДанных
		|ИЗ
		|	РегистрСведений.бит_СКДТаблицГИСЖКХ.СрезПоследних(&Период, ТаблицаШаблонаГИСЖКХ В (&МассивТаблиц)) КАК бит_СКДТаблицГИСЖКХСрезПоследних
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("МассивТаблиц", МассивТаблиц);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СКД          = Выборка.СхемаКомпоновкиДанных.Получить();
		Настройки    = СКД.ВариантыНастроек.Основной.Настройки;
		//Настройки    = СКД.НастройкиПоУмолчанию;
		Для Каждого ЭлементСтруктурыПараметров Из СтруктураПараметров Цикл
			ПараметрСКД = Настройки.ПараметрыДанных.Элементы.Найти(ЭлементСтруктурыПараметров.Ключ);
			Если ПараметрСКД <> Неопределено Тогда
				ПараметрСКД.Значение      = ЭлементСтруктурыПараметров.Значение;
				Если значениезаполнено(ЭлементСтруктурыПараметров.Значение) тогда
					ПараметрСКД.Использование = Истина;
				иначе
					ПараметрСКД.Использование = Ложь;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
 		Если Выборка.ТаблицаШаблонаГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПоставщиковУслугМО Тогда
			ТЗПоставщиков = ТаблицаСКД(СКД, Настройки, СтруктураПараметров);			
						
			ТаблицаПоставщиковУслугМО = ПодготовитьТаблицуПоставщиковМО(ТЗПоставщиков); // Группировка по поставщикам, не более 4 услуг по приоритету.
			СоответствиеДанныхМакета.Вставить(Выборка.ТаблицаШаблонаГИСЖКХ, ТаблицаПоставщиковУслугМО); 
		Иначе		
			
			//25.12.2019
			если Выборка.ТаблицаШаблонаГИСЖКХ.Наименование = "Таблица платежных документов 1-2 2020" или 
				Выборка.ТаблицаШаблонаГИСЖКХ.Наименование = "Таблица платежных документов 1-2 (кап. рем.)2020"
				или Выборка.ТаблицаШаблонаГИСЖКХ.Наименование = "Таблица платежных документов 1-2 2024" тогда
				ТЗПоставщиков = ТаблицаСКД(СКД, Настройки, СтруктураПараметров);
				СоответствиеДанныхМакета.Вставить(Выборка.ТаблицаШаблонаГИСЖКХ, ТЗПоставщиков); 
			иначе
				если Выборка.ТаблицаШаблонаГИСЖКХ.Наименование = "Таблица платежных документов 3-6 2020" или 
					// БИТ ЖКХ 23.03.2020
					Выборка.ТаблицаШаблонаГИСЖКХ.Наименование = "Таблица платежных документов 3-6 (кап. рем.)2020"тогда
					ТЗПоставщиков = ТаблицаСКД(СКД, Настройки, СтруктураПараметров);
					СоответствиеДанныхМакета.Вставить(Выборка.ТаблицаШаблонаГИСЖКХ, ТЗПоставщиков); 
				иначе
					если Выборка.ТаблицаШаблонаГИСЖКХ.Наименование = "Таблица платежных документов платежные реквизиты"
						ИЛИ Выборка.ТаблицаШаблонаГИСЖКХ.Наименование = "Таблица платежных документов платежные реквизиты 1" тогда
						ТЗПоставщиков = ТаблицаСКД(СКД, Настройки, СтруктураПараметров);
						СоответствиеДанныхМакета.Вставить(Выборка.ТаблицаШаблонаГИСЖКХ, ТЗПоставщиков);	  
					иначе
						
						// БИТ ЖКХ 23.04.2020   
						если Выборка.ТаблицаШаблонаГИСЖКХ.Наименование = "Таблица помещений" тогда 
							
							таблицаПомещений = ТаблицаСКД(СКД, Настройки, СтруктураПараметров);		
							если ЭтотОбъект.ВыводитьКомнаты = ложь тогда
								таблицаПомещений.Свернуть("АдресПомещения, КодФИАС_ИдентификаторГИСЖКХ, НомерЗаписи, НомерЛС, НомерПомещения, ТипПомещенияБлок, УникальныйНомерГИСЖКХ");
								таблицаПомещений.Колонки.Добавить("НомерКомнаты");
							конецесли;	
							СоответствиеДанныхМакета.Вставить(Выборка.ТаблицаШаблонаГИСЖКХ, таблицаПомещений); 
							
						иначе	
							СоответствиеДанныхМакета.Вставить(Выборка.ТаблицаШаблонаГИСЖКХ, ТаблицаСКД(СКД, Настройки, СтруктураПараметров)); 
						конецесли;
						
					конецесли;	
				конецесли;	
			конецесли;	
			
			
		КонецЕсли;
		
	КонецЦикла;
	
	//09.04.2019
	если ЭтотОбъект.ДолговойПД = перечисления.ДаНет.Да тогда
		
	  спр = Справочники.бит_ТаблицыШаблоновГИСЖКХ.НайтиПоНаименованию("Таблица платежных документов ДПД");
	  таблицаДПД = СоответствиеДанныхМакета.Получить(спр);
	  если таблицаДПД <> неопределено тогда
		  копияТаблицыДПД = таблицаДПД.Скопировать();
		  копияТаблицыДПД.Свернуть("ЛицевойСчет");
		  МассивЛицевыхСчетов = копияТаблицыДПД.ВыгрузитьКолонку("ЛицевойСчет");	 	  
		    
		  спр = Справочники.бит_ТаблицыШаблоновГИСЖКХ.НайтиПоНаименованию("Таблица платежных документов 1-2");
		  таблица12 = СоответствиеДанныхМакета.Получить(спр);  		
		  если таблица12 <> неопределено тогда

			  если МассивЛицевыхСчетов.Количество() > 0 и таблицаДПД.Количество() > 0 тогда
		
				Индекс = таблица12.Количество() - 1; 
				Пока Индекс >= 0 Цикл 
					
					если МассивЛицевыхСчетов.Найти (таблица12[Индекс].ЛицевойСчет) = неопределено тогда 
						таблица12.Удалить(Индекс); 					 
					КонецЕсли; 
					 
					Индекс = Индекс - 1; 
				КонецЦикла;		
						  
			  конецесли;
			  
			  для каждого стр из таблица12 цикл
				  
				 стр.Льготы = ""; 
				 стр.РазмерВзносаНаКвМ = "";  
				 стр.ВсегоНачислено = "";  
				 стр.ПерерасчетыВсего = "";  
				 стр.ЛьготыСубсидии = "";  
				 стр.ПорядокРасчетов = "";  
				 стр.ИтогоКОплате = "";  
				 стр.ПениИтого = "";  
				 	  
			  КонецЦикла;	
			 
		  конецесли;
	  конецесли;
	конецесли; 
	
	Возврат СоответствиеДанныхМакета;
	
КонецФункции

// Формирует и возвращает таблицу значений по СКД и настройкам
// Параметры:
// 	СКД - схема компоновки данных,
// 	Настройки - вариант настроек схемы, по которым необходимо сформировать таблицу.
//
Функция ТаблицаСКД(СКД, Настройки, СтруктураПараметров)
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД,Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	УслугаРФКР     = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000022");
	
	//18.04.2019
	если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СКД.Параметры, "ДеОптимизацияЗапроса") = истина и
		СКД.Параметры.ДеОптимизацияЗапроса.Значение = истина тогда 
	 если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(МакетКомпоновки.НаборыДанных, "НаборДанных1")	тогда
	  МакетКомпоновки.НаборыДанных.НаборДанных1.Запрос = СКД.НаборыДанных.НаборДанных1.Запрос;
	 конецесли; 
	 
	 //если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(МакетКомпоновки.НаборыДанных, "НаборДанных2")	тогда
	 // МакетКомпоновки.НаборыДанных.НаборДанных2.Запрос = СКД.НаборыДанных.НаборДанных2.Запрос;
	 //конецесли; 

	конецесли;  
  
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ИспользованиеВнешнихФункций = Истина; // Без этого параметра запрещено обращение к функциям общих модулей из СКД.
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, СтруктураПараметров,, ИспользованиеВнешнихФункций);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
		//1.11.2018
	если ЭтотОбъект.СворачиватьТаблицу = истина и ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СКД.Параметры, "ПроизводитьСвертку") = истина и
		   СКД.Параметры.ПроизводитьСвертку.Значение = истина тогда
		если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СКД.Параметры, "ПоляСвертки") = истина и
			   ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СКД.Параметры, "ПоляСуммирования") = истина и 
			     ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СКД.Параметры, "ЗначенияСвертки") = истина тогда
		 ТаблицаЗначений = бит_Утилиты.ПолучитьСвернутуюТаблицуДляОтчета(ТаблицаЗначений, СКД.Параметры.ПоляСвертки, СКД.Параметры.ПоляСуммирования, СКД.Параметры.ЗначенияСвертки);
		 
		 //19.03.2019
		 для каждого стр из ТаблицаЗначений цикл
			 
			 если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.ОбъемКомУслугОбщ = 0) или
				    (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.ОбъемКомУслугОбщ = 0) тогда
				стр.ОбъемКомУслугОбщ = ""; 
			 конецесли;	
			 
			 если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.НачисленоОбщДом = 0) или
				    (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.НачисленоОбщДом = 0) тогда
				стр.НачисленоОбщДом = ""; 
			 конецесли;	
			
			 если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.СуммарныйОбъемОбщ = 0) или
				    (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.СуммарныйОбъемОбщ = 0) тогда
				стр.СуммарныйОбъемОбщ = ""; 
			 конецесли;	
			
			 если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.СуммаПересчетов = 0) или
				    (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.СуммаПересчетов = 0) тогда
				стр.СуммаПересчетов = ""; 
			 конецесли;	

			 если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.ИтогоКОплатеВсегоОбщегоИмущества = 0) или
				    (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.ИтогоКОплатеВсегоОбщегоИмущества = 0) тогда
				стр.ИтогоКОплатеВсегоОбщегоИмущества = ""; 
			 конецесли;				 			 
						 
		 конеццикла;	 
		 
	    конецесли; 
	конецесли;  
	//---
	
	//7.11.2019
	если ЭтотОбъект.СворачиватьТаблицуГорячегоВодоснабжения = истина и ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СКД.Параметры, "ПроизводитьСверткуГорячегоВодоснабжения") = истина и
		   СКД.Параметры.ПроизводитьСвертку.Значение = истина тогда
		если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СКД.Параметры, "ПоляСвертки") = истина и
			   ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СКД.Параметры, "ПоляСуммирования") = истина и 
			     ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СКД.Параметры, "ЗначенияСверткиГорячегоВодоснабжения") = истина тогда
		 ТаблицаЗначений = бит_Утилиты.ПолучитьСвернутуюТаблицуДляОтчета(ТаблицаЗначений, СКД.Параметры.ПоляСвертки, СКД.Параметры.ПоляСуммирования, СКД.Параметры.ЗначенияСверткиГорячегоВодоснабжения);
		 
		 //19.03.2019
		 для каждого стр из ТаблицаЗначений цикл
			 
			 если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.ОбъемКомУслугОбщ = 0) или
				    (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.ОбъемКомУслугОбщ = 0) тогда
				стр.ОбъемКомУслугОбщ = ""; 
			 конецесли;	
			 
			 если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.НачисленоОбщДом = 0) или
				    (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.НачисленоОбщДом = 0) тогда
				стр.НачисленоОбщДом = ""; 
			 конецесли;	
			
			 если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.СуммарныйОбъемОбщ = 0) или
				    (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.СуммарныйОбъемОбщ = 0) тогда
				стр.СуммарныйОбъемОбщ = ""; 
			 конецесли;	
			
			 если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.СуммаПересчетов = 0) или
				    (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.СуммаПересчетов = 0) тогда
				стр.СуммаПересчетов = ""; 
			 конецесли;	

			 если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.ИтогоКОплатеВсегоОбщегоИмущества = 0) или
				    (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.ИтогоКОплатеВсегоОбщегоИмущества = 0) тогда
				стр.ИтогоКОплатеВсегоОбщегоИмущества = ""; 
			 конецесли;				 			 
						 
		 конеццикла;	 
		 
	    конецесли; 
	конецесли;  
	//---

	//7.11.2019
	если ЭтотОбъект.СворачиватьТаблицуХолодногоВодоснабжения = истина и ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СКД.Параметры, "ПроизводитьСверткуХолодногоВодоснабжения") = истина и
		   СКД.Параметры.ПроизводитьСвертку.Значение = истина тогда
		если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СКД.Параметры, "ПоляСвертки") = истина и
			   ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СКД.Параметры, "ПоляСуммирования") = истина и 
			     ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СКД.Параметры, "ЗначенияСверткиХолодногоВодоснабжения") = истина тогда
		 ТаблицаЗначений = бит_Утилиты.ПолучитьСвернутуюТаблицуДляОтчета(ТаблицаЗначений, СКД.Параметры.ПоляСвертки, СКД.Параметры.ПоляСуммирования, СКД.Параметры.ЗначенияСверткиХолодногоВодоснабжения);
		 
		 ////19.03.2019
		 для каждого стр из ТаблицаЗначений цикл
			 
			 если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.ОбъемКомУслугОбщ = 0) или
		    	    (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.ОбъемКомУслугОбщ = 0) тогда
		    	стр.ОбъемКомУслугОбщ = ""; 
		     конецесли;	
		     
		     если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.НачисленоОбщДом = 0) или
		    	    (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.НачисленоОбщДом = 0) тогда
		    	стр.НачисленоОбщДом = ""; 
		     конецесли;	
		    
		     если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.СуммарныйОбъемОбщ = 0) или
		    	    (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.СуммарныйОбъемОбщ = 0) тогда
		    	стр.СуммарныйОбъемОбщ = ""; 
		     конецесли;	
		    
		     если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.СуммаПересчетов = 0) или
		    	    (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.СуммаПересчетов = 0) тогда
		    	стр.СуммаПересчетов = ""; 
		     конецесли;	

		     если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.ИтогоКОплатеВсегоОбщегоИмущества = 0) или
		    	    (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.ИтогоКОплатеВсегоОбщегоИмущества = 0) тогда
		    	стр.ИтогоКОплатеВсегоОбщегоИмущества = ""; 
			 конецесли;		
			 
			 //11.11.2019
			 //25.11.2019
			 //если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.СуммаКОплате = 0) или
			 //       (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.СуммаКОплате = 0) тогда
			 //   стр.СуммаКОплате = ""; 
			 //конецесли;	
			 
			 //11.11.2019
			 если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.ОбъемКомУслугИнд = 0) или
		    	    (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.ОбъемКомУслугИнд = 0) тогда
		    	стр.ОбъемКомУслугИнд = ""; 
			 конецесли;	    
			 
			 //11.11.2019
			 если (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение и стр.ИтогоКОплатеВсего = 0) или
		    	    (стр.УслугаЖКХГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод и стр.ИтогоКОплатеВсего = 0) тогда
			   // БИТ ЖКХ 24.02.2021		
			   если стр.НачисленоЗаРасчетныйПериод = 0 И ЗначениеЗаполнено(стр.Перерасчеты) = ложь тогда		
		    	стр.ИтогоКОплатеВсего = ""; 
			   конецесли;	
			 конецесли;	  
			 
		 конеццикла;	 
		 
	    конецесли; 
	конецесли;  
	//---
	
	//19.03.2019
	для каждого стр из ТаблицаЗначений цикл			 
			 			 
	   если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(стр, "ПовышающийКоэффициент") = истина и стр.ПовышающийКоэффициент= неопределено и стр.Субсидии = 0 тогда
		 стр.Субсидии = "";
	   конецесли; 	 
			 
	конеццикла;	 
   //---------------

   //25.10.2019
   ТаблицаЗначений = бит_ОбщегоНазначения.УбратьНулиИзПоляТаблицы (ТаблицаЗначений, "СуммаПересчетовКап");
   //11.11.2019
   ТаблицаЗначений = бит_ОбщегоНазначения.УбратьНулиИзПоляТаблицы (ТаблицаЗначений, "ОбъемКомУслугИнд");
   //25.11.2019
   //ТаблицаЗначений = бит_ОбщегоНазначения.УбратьНулиИзПоляТаблицы (ТаблицаЗначений, "СуммаКОплате");
   ТаблицаЗначений = бит_ОбщегоНазначения.УбратьНулиИзПоляТаблицы (ТаблицаЗначений, "Субсидии");
   ТаблицаЗначений = бит_ОбщегоНазначения.УбратьНулиИзПоляТаблицы (ТаблицаЗначений, "НачисленоИнд");
   ТаблицаЗначений = бит_ОбщегоНазначения.УбратьНулиИзПоляТаблицы (ТаблицаЗначений, "НачисленоОбщДом");
   ТаблицаЗначений = бит_ОбщегоНазначения.УбратьНулиИзПоляТаблицы (ТаблицаЗначений, "ИтогоКОплатеВсегоОбщегоИмущества");
   ТаблицаЗначений = бит_ОбщегоНазначения.УбратьНулиИзПоляТаблицы (ТаблицаЗначений, "ОбъемКомУслугОбщ");
   ТаблицаЗначений = бит_ОбщегоНазначения.УбратьНулиИзПоляТаблицы (ТаблицаЗначений, "СуммарныйОбъемОбщ");
   ТаблицаЗначений = бит_ОбщегоНазначения.УбратьНулиИзПоляТаблицы (ТаблицаЗначений, "СуммаПересчетов");
   
   // БИТ ЖКХ 04.02.2020
   если ТаблицаЗначений.Количество() > 0
	    и ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТаблицаЗначений[0], "НомерПлатежногоДокумента")
		  и ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТаблицаЗначений[0], "Услуга") тогда
	ТаблицаЗначений.Сортировать("НомерПлатежногоДокумента Возр, Услуга Возр");	  
   конецесли;
	  
   Возврат ТаблицаЗначений;
	
КонецФункции

// БИТ ЖКХ 25.11.2019
функция ПолучитьТаблицуДляШаблона1_2(ТЗПоставщиков)
	
	табВозврата = ТЗПоставщиков.Скопировать();
	//БИТ ЖКХ 24.01.2020
	табВозврата.Колонки.Добавить("ИтогоКОплатеСКапремонтом");	
	Если ТабВозврата.Колонки.Найти("НачисленоПени") = Неопределено Тогда
		табВозврата.Колонки.Добавить("НачисленоПени");
	КонецЕсли;
	
	для каждого стр из табВозврата цикл
		
		// БИТ ЖКХ 12.02.2020
	 //   если стр.ИтогоКОплатеЗаРС <> "" тогда 			
	 //    стр.КОплатеЗаМесяц = Число(стр.ИтогоКОплатеЗаРС);
	 //   иначе 
	 //    стр.КОплатеЗаМесяц = 0;
	 //   конецесли; 
	 // 
	 //   если стр.ИтогоКОплатеЗаРС <> "" тогда 			
	 //    стр.ИтогоКОплатеЗаРС = Число(стр.ИтогоКОплатеЗаРС) + ?(Стр.НачисленоПени = "" или Стр.НачисленоПени =неопределено, 0, Число(Стр.НачисленоПени));
	 //   иначе 
	 //    стр.ИтогоКОплатеЗаРС = 0;
	 //   конецесли; 
	 // 
	 //   // БИТ ЖКХ 27.02.2020			
	 //   если стр.ПениИтого <> "" тогда
	 //    стр.КОплатеЗаМесяц = Число(стр.КОплатеЗаМесяц) + Число(стр.ПениИтого);
	 //   конецесли;	 
	 //
	 //   // БИТ ЖКХ 12.02.2020
	 //   если стр.ИтогоКОплатеЗаРССальдоСПени <> "" тогда 		
	 //    стр.ИтогоКОплатеСКапремонтом = стр.ИтогоКОплатеЗаРССальдоСПени; 
	 //   иначе 
	 //    стр.ИтогоКОплатеСКапремонтом = 0;
	 //   конецесли;  
		попытка
		 // БИТ ЖКХ 12.03.2020
		 стр.НомерПлатежногоРеквизита = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(стр.НомерПлатежногоРеквизита, Истина, Истина);
	    исключение
		конецпопытки; 
		стр.РасчетныйСчет = "";
		// БИТ ЖКХ 12.02.2020
		//если стр.ИтогоКОплатеЗаРССальдоСПени <> "" тогда 
		// стр.ИтогоКОплатеЗаРССальдоСПени = стр.ИтогоКОплатеЗаРССальдоСПени;
		//иначе 
		// стр.ИтогоКОплатеЗаРССальдоСПени = 0;
		//конецесли; 
		//
		//если стр.ИтогоКОплатеЗаРССальдо <> "" тогда 
		// стр.ИтогоКОплатеЗаРССальдо = стр.ИтогоКОплатеЗаРССальдо;
		//иначе 
		// стр.ИтогоКОплатеЗаРССальдо = 0;
		//конецесли; 
		
	конеццикла;	
	
	мТаблица1_2 = табВозврата; 
	возврат табВозврата;
	
конецфункции	

// БИТ ЖКХ 11.02.2020
функция ПолучитьТаблицуДляШаблонаПлатежныеРеквизиты(ТЗПоставщиков)
		
	табВозврата = ТЗПоставщиков.Скопировать();
	табВозврата.Свернуть("НомерПлатежногоРеквизита, НомерЛицевогоСчета, НомерПлатежногоДокумента, РасчетныйПериод, БИКБанка, РасчетныйСчет, Задолженность, ИтогоКОплате, СуммаКОплате", "АвансНаНачалоПериода");
	
	для каждого стр из табВозврата цикл
		
		// БИТ ЖКХ 29.04.2020
		стр.НомерПлатежногоРеквизита = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(стр.НомерПлатежногоРеквизита, Истина, Истина);
		//Мельник 090321 Изменение суммы к оплате
		//стр.СуммаКОплате = стр.ИтогоКОплате + стр.Задолженность + стр.АвансНаНачалоПериода;
		//стр.СуммаКОплате = стр.КОплатеЗаРССальдо;
		//Мельник 090321 Изменение суммы к оплате
		//стр.СуммаКОплате = НайтиДанныеПосчету (стр.НомерЛицевогоСчета, "КОплатеЗаМесяц"); 
		Если стр.СуммаКОплате = "" или стр.СуммаКОплате = неопределено тогда
			стр.СуммаКОплате =0 ;
		КонецЕсли;
		
		стр.Задолженность = стр.СуммаКОплате - стр.ИтогоКОплате;
		Если стр.СуммаКОплате < 0 Тогда
			стр.СуммаКОплате = 0;	
		КонецЕсли;
		
		//оплата = НайтиДанныеПосчету (стр.НомерЛицевогоСчета, "Оплачено");
		// БИТ ЖКХ 12.10.2020
	   // если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(мТаблица3_6[0], "ЛицевойСчет") = истина тогда
	   //аванс = НайтиАвансПоСчету(стр.НомерЛицевогоСчета);
	   // конецесли; 
		
		// БИТ ЖКХ 27.02.2020
		//если оплата <> "" тогда
		//  // БИТ ЖКХ 08.10.2020
		//  //Задолжненность = число(стр.Задолженность) - число(оплата);	
		//  //стр.Задолженность = ?(Задолжненность > 0, Задолжненность, -Задолжненность);
		//  //стр.Задолженность = аванс;
		//конецесли;	
		
	конеццикла;	
	
	возврат табВозврата;
	
конецфункции	

// БИТ ЖКХ 12.10.2020
функция НайтиАвансПоСчету (НомерЛС)
	
 Для Каждого стр из мТаблица3_6 Цикл
	 
	если строка(стр.ЛицевойСчет) = НомерЛС тогда		
	 возврат стр.АвансНаНачалоПериода;
    конецесли;
 
 КонецЦикла;

 возврат 0;
КонецФункции	

// БИТ ЖКХ 12.02.2020
функция НайтиДанныеПосчету (номерЛС, имяКолонки)
	объектЛС = справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(номерЛС);
	Отбор = Новый Структура;
	Отбор.Вставить("ЛицевойСчет", объектЛС);
	Строки = мТаблица1_2.НайтиСтроки(Отбор);
	если Строки.Количество() > 0 тогда	
		если Строки[0][имяКолонки]	<> "" тогда
			возврат Строки[0][имяКолонки]; 
		иначе
			возврат 0;
		конецесли; 
	иначе	
		возврат 0;  
	конецесли;	
конецфункции	


// БИТ ЖКХ 26.11.2019
функция ПолучитьТаблицуДляШаблона3_6(ТЗПоставщиков)
	
	табВозврата = ТЗПоставщиков.Скопировать();
	//УслугаРФКР     = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000022");
	Если ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.КапитальныйРемонт Тогда
		ТабВозврата.Свернуть("Услуга, НомерПлатежногоДокумента","АвансНаНачалоПериода, ЗакрытиеВхДолга, ИтогПени, ПроцентыЗаРассрочку, ПроцентыЗаРассрочкуСумма, ИтогоКОплате, ИтогоКОплатеВсего, ИтогоКОплатеВсегоОбщегоИмущества, НачисленоЗаРасчетныйПериод, НачисленоИнд, НачисленоОбщДом, НормативИнд, НормативОбщ, ОбъемКомУслугИнд, ОбъемКомУслугОбщ, СуммаКОплате, СуммаПересчетов, СуммарныйОбъемИнд, СуммарныйОбъемОбщ, Тариф, ТекПоказанияИнд, ТекПоказанияОбщ");
	КонецЕсли;
	
	для каждого стр из табВозврата цикл
		
		//Если ДолгРФКР(УслугаРФКР,мСтруктураДанных.ЛицевойСчет,ЭтотОбъект.Дата) <= 0 Тогда
		//Иначе
		//КонецЕсли;
		
		// БИТ ЖКХ 17.02.2020
		стр.СуммаКОплате = стр.ИтогоКОплатеВсего;
		
		//+КлинскихПГ_2021-11-19 забираем значение из таблицы
		стр.АвансНаНачалоПериода =  стр.ИтогоКОплате - стр.ИтогоКОплатеВсего;
		//-КлинскихПГ_2021-11-19 забираем значение из таблицы
		//++Мельник 271022 Выведение нулевого тарифа
		Тариф = ?((Стр.Тариф = Неопределено ИЛИ Стр.Тариф = ""), "0,00", Формат(Стр.Тариф, "ЧДЦ=2; ЧН=0,00"));   
		Попытка 
			Стр.Тариф = Число(Тариф);
		Исключение       
		КонецПопытки;
		//--Мельник 
		// БИТ ЖКХ 13.02.2020
		стр.ИтогоКОплате = стр.ИтогоКОплате + стр.ИтогПени;
		Если стр.ИтогоКОплате < 0 Тогда
			стр.ИтогоКОплате = 0;
		КонецЕсли;
		
		Если стр.ИтогоКОплатеВсего < 0 Тогда
			стр.ИтогоКОплатеВсего = 0;
		КонецЕсли;
		
		если стр.ПроцентыЗаРассрочку = 0 тогда
			стр.ПроцентыЗаРассрочку = "";	
			стр.ПроцентыЗаРассрочкуСумма = "";
		конецесли;	
		
	конеццикла;	
	
	мТаблица3_6 = табВозврата.Скопировать();
	// БИТ ЖКХ 19.10.2020
	если табВозврата.Количество() > 0 И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(табВозврата[0], "ЛицевойСчет") = истина тогда
	 мТаблица3_6.Свернуть("ЛицевойСчет", "АвансНаНачалоПериода");
    конецесли;
 
	возврат табВозврата;
	
конецфункции


Функция ДолгРФКР(пУслуга, пЛицевойСчет, пДата);
	
	//Период = КонецДня(КонецМесяца(Дата)); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(
	|			КонецПериода(&Период,Месяц),
	|			УслугаЖКХ = &Услуга
	|				И ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстатки";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", пЛицевойСчет);
	Запрос.УстановитьПараметр("Период", пДата);
	Запрос.УстановитьПараметр("Услуга", пУслуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.СуммаОстаток;
	Иначе	
		Возврат 0;	
	КонецЕсли; 
	
КонецФункции


Функция ПодготовитьТаблицуПоставщиковМО(ТЗПоставщиков)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗПоставщиков", ТЗПоставщиков);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗПоставщиков.ПоставщикУслуг КАК ПоставщикУслуг,
	|	ТЗПоставщиков.Приоритет КАК Приоритет,
	|	ТЗПоставщиков.КраткоеНаименование КАК КраткоеНаименование,
	|	ТЗПоставщиков.ПолноеНаимменование КАК ПолноеНаимменование,
	|	ТЗПоставщиков.ЮрАдрес КАК ЮрАдрес,
	|	ТЗПоставщиков.ФактАдрес КАК ФактАдрес,
	|	ТЗПоставщиков.ИНН КАК ИНН,
	|	ТЗПоставщиков.КПП КАК КПП,
	|	ТЗПоставщиков.БанковскиеРеквизиты КАК БанковскиеРеквизиты,
	|	ТЗПоставщиков.Телефон КАК Телефон,
	|	ТЗПоставщиков.Услуга1 КАК Услуга1,
	|	ТЗПоставщиков.ЭлектроннаяПочта КАК ЭлектроннаяПочта
	|ПОМЕСТИТЬ ВТ_Поставщики
	|ИЗ
	|	&ТЗПоставщиков КАК ТЗПоставщиков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Поставщики.ПоставщикУслуг КАК ПоставщикУслуг,
	|	ВТ_Поставщики.Приоритет КАК Приоритет,
	|	ВТ_Поставщики.КраткоеНаименование КАК КраткоеНаименование,
	|	ВТ_Поставщики.ПолноеНаимменование КАК ПолноеНаимменование,
	|	ВТ_Поставщики.ЮрАдрес КАК ЮрАдрес,
	|	ВТ_Поставщики.ФактАдрес КАК ФактАдрес,
	|	ВТ_Поставщики.ИНН КАК ИНН,
	|	ВТ_Поставщики.КПП КАК КПП,
	|	ВТ_Поставщики.БанковскиеРеквизиты КАК БанковскиеРеквизиты,
	|	ВТ_Поставщики.Телефон КАК Телефон,
	|	ВТ_Поставщики.Услуга1 КАК Услуга1,
	|	ВТ_Поставщики.ЭлектроннаяПочта КАК ЭлектроннаяПочта
	|ИЗ
	|	ВТ_Поставщики КАК ВТ_Поставщики
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|ИТОГИ ПО
	|	ПоставщикУслуг";
	
	ВыборкаПоставщиков = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТЗПоставщиков.Очистить();
	
	Пока ВыборкаПоставщиков.Следующий() Цикл
		
		Сч = 1;
		ВыборкаУслуг = ВыборкаПоставщиков.Выбрать();
		Пока ВыборкаУслуг.Следующий() И Сч < 5 Цикл
			
			Если Сч = 1 Тогда
				НСтр = ТЗПоставщиков.Добавить();
				НСтр.ПоставщикУслуг			= ВыборкаУслуг.ПоставщикУслуг;
				НСтр.Приоритет				= ВыборкаУслуг.Приоритет;
				НСтр.КраткоеНаименование	= ВыборкаУслуг.КраткоеНаименование;
				НСтр.ПолноеНаимменование	= ВыборкаУслуг.ПолноеНаимменование;
				НСтр.ЮрАдрес				= ВыборкаУслуг.ЮрАдрес;
				НСтр.ФактАдрес				= ВыборкаУслуг.ФактАдрес;
				НСтр.ИНН					= ВыборкаУслуг.ИНН;
				НСтр.БанковскиеРеквизиты	= ВыборкаУслуг.БанковскиеРеквизиты;
				НСтр.Телефон				= ВыборкаУслуг.Телефон;
				НСтр.ЭлектроннаяПочта		= ВыборкаУслуг.ЭлектроннаяПочта;
			КонецЕсли;
			
			Если Сч = 1 Тогда
				НСтр.Услуга1 = ВыборкаУслуг.Услуга1;
			ИначеЕсли Сч = 2 Тогда	
				НСтр.Услуга2 = ВыборкаУслуг.Услуга1;
			ИначеЕсли Сч = 3 Тогда	
				НСтр.Услуга3 = ВыборкаУслуг.Услуга1;
			Иначе	
				НСтр.Услуга4 = ВыборкаУслуг.Услуга1;
			КонецЕсли;
			
			Сч = Сч + 1;
			
		КонецЦикла; // ВыборкаУслуг.
		
	КонецЦикла; // ВыборкаПоставщиков.
	
	Возврат ТЗПоставщиков;
	
КонецФункции

#КонецОбласти

#КонецЕсли
